todos_rails/app/controllers/api/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", "t"], ["updated_at", "2018-07-03 21:11:27.257476"], ["id", 1]]
---
  def update
    @todo = Todo.find(params[:id])
    if @todo.update(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 11]]
SELECT "todos".* FROM "todos"
---
  def destroy
    @todo = Todo.find(params[:id])
    if @todo
      @todo.destroy
      render json: Todo.all